import {ArticlePreviewType} from '@/components/features/article-preview/context/article-preview-context';

export const articles: ArticlePreviewType[] = [
	{
		"title":     "Искусственный интеллект: перспективы и вызовы",
		"id":        "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Искусственный интеллект (ИИ) продолжает активно развиваться, предлагая новые возможности в различных сферах. Однако, наряду с прогрессом, возникают вопросы о регулировании, этике и влиянии на рынок труда."
	},
	{
		"title":     "Здоровый образ жизни: основные принципы",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Здоровый образ жизни включает сбалансированное питание, регулярные физические упражнения, достаточный сон и управление стрессом. Эти факторы способствуют улучшению качества жизни и продлению долголетия."
	},
	{
		"title":     "Космический туризм: будущее уже наступило",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "С развитием технологий частные компании предлагают туристические полеты в космос. Несмотря на высокую стоимость, этот сегмент рынка обещает стать доступным для более широкой аудитории в будущем."
	},
	{
		"title":     "Влияние социальных сетей на современное общество",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Социальные сети трансформировали коммуникацию и распространение информации. Однако, наряду с преимуществами, такие платформы могут способствовать дезинформации и формированию зависимости."
	},
	{
		"title":     "Электромобили: экологическая альтернатива",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Электромобили становятся все более популярными благодаря их экологическим преимуществам и экономии на топливе. Производители активно инвестируют в развитие инфраструктуры зарядных станций."
	},
	{
		"title":     "Интернет вещей: как технологии меняют наш быт",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Устройства интернета вещей (IoT) интегрируются в повседневную жизнь, делая дома умнее и удобнее. Однако, вопросы безопасности данных остаются актуальными."
	},
	{
		"title":     "Как развивать креативное мышление",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Креативное мышление можно развивать с помощью практик, таких как мозговые штурмы, чтение разнообразной литературы и изучение новых навыков. Это способствует решению нестандартных задач."
	},
	{
		"title":     "Путешествия в эпоху пандемии",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Пандемия изменила правила и подходы к путешествиям. Туристы стали чаще выбирать внутренний туризм, а требования к безопасности и санитарным нормам возросли."
	},
	{
		"title":     "Роль образования в цифровую эпоху",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Цифровизация образования открывает новые горизонты для обучения, но также требует адаптации учителей и учеников к новым форматам работы и технологий."
	},
	{
		"title":     "Климатические изменения и их последствия",
		id:          "d118027f-dc12-4947-8076-cd0e2bdc5c8e",
		created_at:  "2024-12-25T17:59:04.566Z",
		updated_at:  "2024-12-25T17:59:04.566Z",
		deletedDate: null,
		"text":      "Глобальное потепление оказывает значительное влияние на природу и общество. Меры по сокращению выбросов углерода становятся ключевыми для сохранения экосистемы планеты."
	}
]
